
export default {
    "Редактирование": "Өңдеу",
    "Администрирование": "Әкімшілік",
    "Пользователи и права доступа": "Пайдаланушылар мен қол жеткізу құқықтары",
    "Обратная сортировка": "Кері сұрыптау",
    "Атрибуты": "Төлсипаттар",
    "Файлы": "Файлдар",
    "В работе": "Істе",
    "События": "Оқиғалар",
    "Избранное": "Таңдаулы",
    "Найти": "Іздеу",
    "Пользователь": "Пайдаланушы",
    "Скрытые": "Жасырын",
    "Имя": "Аты",
    "Размер": "Көлем",
    "Дата": "Күн",
    "Атрибуты и справочники": "Төлсипаттар мен анықтамалықтар",
    "Данные пользователя": "Пайдаланушы деректері",
    "Выход": "Шығу",
    "Загрузить": "Жүктеу",
    "Скачать": "Жүктеу алу",
    "Просмотр": "Көру",
    "Копировать": "Көшіру",
    "Вырезать": "Кесіп алу",
    "Вставить": "Кірістіру",
    "Удалить": "Жою",
    "Переименовать": "Атын өзгерту",
    "Создать папку": "Бума құру",
    "Права доступа": "Қолжеткізу құқығы",
    "Взять в работу": "Жұмысқа қабылдау",
    "Сохранить промежуточную версию": "Аралық нұсқасын сақтау",
    "Освободить с сохранением": "Өзгертулерді сақтап босату",
    "Освободить без сохранения": "Өзгертулерсіз босату",
    "Атрибуты файла": "Файл төлсипаттары",
    "Атрибуты папки": "Бума төлсипаттары",
    "Атрибуты папки и вложенных файлов": "Бума және ішкі файлдардың төлсипаттары",











}
